{
  "news1": "Stock Market News: NVIDIA Surges After Record AI Chip Sales\n\nOctober 17, 2025 — Santa Clara, CA\n\nNVIDIA (NVDA) shares jumped 6.4% on Friday, leading gains on the Nasdaq, after the company reported record-breaking quarterly revenue driven by soaring demand for its AI accelerator chips.\n\nThe chipmaker posted revenue of $31.2 billion, up 87% year-over-year, surpassing Wall Street expectations. Analysts attributed the surge to continued adoption of NVIDIA’s H100 and next-generation Blackwell processors among cloud providers and enterprise AI developers.\n\nCEO Jensen Huang emphasized that AI infrastructure “has become the new industrial revolution,” citing strong orders from Amazon Web Services, Microsoft Azure, and Google Cloud.\n\nThe upbeat report also boosted semiconductor peers like AMD and TSMC, contributing to a 2% rise in the Philadelphia Semiconductor Index (SOX). Meanwhile, the S&P 500 added 0.7% and the Nasdaq Composite rose 1.1% in afternoon trading.\n\nHowever, some analysts cautioned that increased competition in the AI hardware market could pressure margins in 2026. Despite the warning, investor sentiment remains bullish as NVIDIA’s market capitalization crosses the $3.5 trillion mark for the first time.",
  "news2": "Stock Market News: Apple Rises on Strong iPhone 17 Sales\n\nOctober 17, 2025 — Cupertino, CA\n\nApple (AAPL) shares climbed 3.2% on Friday after the company reported stronger-than-expected demand for its iPhone 17 lineup, particularly in Asia. The tech giant posted quarterly revenue of $128 billion, surpassing Wall Street estimates.\n\nCEO Tim Cook said that Apple’s expansion into generative AI and AR-powered productivity tools continues to drive growth across its ecosystem. Analysts noted that services revenue hit a new record, helping offset slowing Mac sales.\n\nThe upbeat report boosted investor confidence in the consumer electronics sector, lifting the Nasdaq Composite by 0.8%. Apple’s stock is now trading near its all-time high, with analysts raising price targets following the report.",
  "news3": "Stock Market News: Tesla Drops as Delivery Numbers Miss Expectations\n\nOctober 17, 2025 — Austin, TX\n\nTesla (TSLA) shares fell 5.7% after the company reported lower-than-expected vehicle deliveries for Q3, citing supply chain constraints and a temporary slowdown in European production.\n\nDespite record energy storage deployments, the weaker delivery data fueled investor concerns over demand for high-end EV models. Analysts at Morgan Stanley cut their 12-month price target, saying Tesla may face increased competition from Chinese automakers like BYD and NIO.\n\nCEO Elon Musk said in a brief statement that production will normalize next quarter as new Gigafactory upgrades come online. Still, shares of major EV makers declined, pulling down the S&P 500 by 0.4%.",
  "news4": "Stock Market News: Microsoft Gains on Cloud Revenue Surge\n\nOctober 17, 2025 — Redmond, WA\n\nMicrosoft (MSFT) shares rose 4.5% after the company reported record growth in its Azure cloud division. Quarterly revenue reached $78 billion, driven by strong demand for AI-powered cloud computing and enterprise software.\n\nCEO Satya Nadella highlighted that over 80% of Fortune 500 companies now use Azure AI tools. Analysts credited Microsoft’s early investments in large language models and enterprise automation as key growth drivers.\n\nThe report also lifted other tech giants, including Google and Amazon, as the Nasdaq hit its highest level since mid-2024. Microsoft’s market capitalization is now approaching $3 trillion, reinforcing its position as one of the world’s most valuable companies."
}
